# BuiltInFailures.SharedCoordinatesFailures Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..SharedCoordinatesFailures Members
BuiltInFailures..::..SharedCoordinatesFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..SharedCoordinatesFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CannotAcquireCoordinatesFromLinkWithScaledLocation | Can't acquire coordiantes from a link that has a scaled location. |
| CannotAcquireCoordinatesFromScaledLink | Can't acquire coordinates from a link that is scaled. |

# See Also
BuiltInFailures..::..SharedCoordinatesFailures Class
Autodesk.Revit.DB Namespace